assignments/assignment2/assignment2.org
#+TITLE: ECE 420 Assignment 2
#+AUTHOR: Arun Woosaree
#+OPTIONS: toc:nil


* Trapezoidal Rule

** static
~schedule(static, 2)~ means that OpenMP will divide the iterations into chunks of size 2, and the chunks are distributed to the threads in round robin fashion.
So thread 0 wil get iterations 1, 3, 5, ... 9999 while thread 1 will get iterations 2, 4, 6, ... 9998.
** guided
~schedule(guided)~ means that OpenMP will divide the iterations into chunks, and each thread executes a chunk of iterations and requests another chunk until no more chunks are available. The default chunk size is 1. The chunk size decreases each time a chunk of work is given to a thread. The initial chunk size is proportional to num iterations / num threads, while subsequent chunks are proportional to the remaining number of iterations / num threads. The iterations will look like this:


| Thread |     Chunk | Sizeof Chunk  | Remaining Iterations |
|--------+-----------+---------------+----------------------|
|      0 |    1-5000 | 5000          |                 4999 |
|      1 | 5001-7500 | 4999/2 = 2500 |                 2499 |
|      1 | 7501-8750 | 2499/2 = 1250 |                 1249 |
|      1 | 8751-9375 | 1249/2 = 625  |                  624 |
|      0 | 9376-9687 | 624/2 = 312   |                  312 |
|      1 | 9688-9843 | 312/2 = 156   |                  156 |
|      0 | 9844-9921 | 156/2 = 78    |                   78 |
|      1 | 9922-9960 | 78/2 = 39     |                   39 |
|      1 | 9961-9980 | 39/2 = 20     |                   19 |
|      1 | 9981-9990 | 20/2 = 10     |                    9 |
|      1 | 9991-9995 | 10/2 = 5      |                    4 |
|      0 | 9996-9997 | 5/2 = 2       |                    2 |
|      1 |      9998 | 2/2 = 1       |                    1 |
|      0 |      9999 | 1             |                    0 |



* Odd-Even Transposition Sort

* Maximum Value

* Matrix Vector Multiplication

* Output of Program

* Fibonacci
