assignments/assignment2/assignment2.tex
% Created 2021-03-15 Mon 22:59
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{Arun Woosaree}
\date{\today}
\title{ECE 420 Assignment 2}
\hypersetup{
 pdfauthor={Arun Woosaree},
 pdftitle={ECE 420 Assignment 2},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 27.1 (Org mode 9.5)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents



\section{Trapezoidal Rule}
\label{sec:org9bf5b6b}

\subsection{static}
\label{sec:org04432e9}
\texttt{schedule(static, 2)} means that OpenMP will divide the iterations into chunks of size 2, and the chunks are distributed to the threads in round robin fashion.
So thread 0 wil get iterations 1, 3, 5, \ldots{} 9999 while thread 1 will get iterations 2, 4, 6, \ldots{} 9998.
\subsection{guided}
\label{sec:orgead9c7e}
\texttt{schedule(guided)} means that OpenMP will divide the iterations into chunks, and each thread executes a chunk of iterations and requests another chunk until no more chunks are available. The default chunk size is 1. The chunk size decreases each time a chunk of work is given to a thread. The initial chunk size is proportional to num iterations / num threads, while subsequent chunks are proportional to the remaining number of iterations / num threads. The iterations will look like this:


\begin{center}
\begin{tabular}{rrlr}
Thread & Chunk & Sizeof Chunk & Remaining Iterations\\
\hline
0 & 1-5000 & 5000 & 4999\\
1 & 5001-7500 & 4999/2 = 2500 & 2499\\
1 &  & 2499/2 = 1250 & 1249\\
1 &  & 1249/2 = 625 & 624\\
0 &  & 624/2 = 312 & 312\\
1 &  & 312/2 = 156 & 156\\
0 &  & 156/2 = 78 & 78\\
1 &  & 78/2 = 39 & 39\\
1 &  & 39/2 = 20 & 19\\
1 &  & 20/2 = 10 & 9\\
1 &  & 10/2 = 5 & 4\\
0 &  & 5/2 = 2 & 2\\
1 &  & 2/2 = 1 & 1\\
0 &  & 1 & 0\\
\end{tabular}
\end{center}



\section{Odd-Even Transposition Sort}
\label{sec:orga51c53c}

\section{Maximum Value}
\label{sec:orgde0f2bb}

\section{Matrix Vector Multiplication}
\label{sec:orge73096b}

\section{Output of Program}
\label{sec:org415912c}

\section{Fibonacci}
\label{sec:org7421ce0}
\end{document}
